app/controllers/provinsis_controller.rb

  def index
    @provinsis = Provinsi.all
---
SELECT "provinsis".* FROM "provinsis"