app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings"
---
  def index
    @settings = Setting.all