app/controllers/users_controller.rb

  def index
    # @users = User.all
    @role_name = 'admin'
    @title = "Manage Users "
    @get_avatar = ''
    @user = User.search(params[:search]).paginate(page: params[:page],per_page: 20) or not_found
---
SELECT  "users".* FROM "users" LIMIT 20 OFFSET 0